Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/travelling_abroad_with_children.html.txt.tmx
Source language: en
Languages: ga

source: Travelling abroad with children
ga: Ag taisteal thar lear le páistí

source: Travelling abroad with children can be an extremely rewarding experience
ga: Nuair atá tú ag taisteal thar lear le páistí is féidir leis a bheith ina eachtra luachmhar

source: Visiting other countries and experiencing different cultures can be a wonderful educational opportunity
ga: Is an-deis oideachasúil é cuairt a thabhairt ar thíortha eile agus taithí a fháil ar chultúir éagsúla

source: It is important, however, to consider in advance whether the destination will suit all the members of your family, including children
ga: Ach mar sin féin tá sé tábhachtach go ndéanfá machnamh roimhré, an bhfuil sé fóirstineach do gach ball den chlann, do chuid páistí san áireamh

source: Very small children (less than 18 months) really will be unaware of the holiday destination and so in most cases, they would prefer to be at home in familiar surroundings
ga: Má tá na páistí an-óg ( níos óige ná 18 mí ) ní thuigfidh siad go bhfuil siad ar saoire agus i gcuid mhór de na cásanna, b'fhearr leo a bheith ag baile san áit a bhfuil aithne agus eolas acu ar gach rud timpeall orthu

source: Since October 2004 all children, regardless of age, must obtain an individual Irish passport in their own name
ga: Ón Deireadh Fómhair 2004 i leith caithfidh gach leanbh, is cuma cén aois é/í a p(h)as féin a fháil ina (h)ainm féin

source: You should ensure in advance of travel that all passports are in date with at least six months to their expiry date
ga: Sula dtosaíonn tú ar thuras ba chóir duit a chinntiú nach mbeidh aon phas as dáta go ceann sé mhí ar a laghad

source: See our document on passports for children for further information
ga: Féach ar ár ndoiciméad ar phasanna do leanaí le haghaidh tuilleadh eolais

source: Travelling with someone else’s child
ga: Ag taisteal le leanbh duine eile

source: If you are travelling with someone else’s child or with a child with a different surname, you may have to explain the relationship between you and the child to immigration officers in the country you are travelling to
ga: Má tá tú ag taisteal le leanbh duine eile nó le leanbh a bhfuil sloinne difriúil aige/aici, b’fhéidir go mbeidh ort an gaol idir tú féin agus an leanbh a mhíniú d’oifigigh inimirce sa tír a bhfuil tú ag taisteal chuici

source: If you are travelling alone with your child, you may have to provide evidence that you have the other parent’s consent to travel
ga: Má tá tú ag taisteal leat féin le do leanbh, b’fhéidir go mbeidh ort fianaise a sholáthar go bhfuil toiliú an tuismitheora eile agat chun taisteal

source: You can find advice on the type of documentation you should bring with you in these situations on the Irish Naturalisation and Immigration Service (INIS) website
ga: Féadfaidh tú teacht ar chomhairle ar an saghas cáipéisíochta ba cheart duit a thabhairt leat sna cásanna seo ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: You should seek information and advice from your family doctor (GP) if you will be travelling outside Western Europe, North America, Australia or New Zealand, as vaccinations may be compulsory or highly advisable when visiting some countries
ga: Faigh tuilleadh eolais agus comhairle ó do dhochtúir má tá tú ag taisteal taobh amuigh de cheantar Iarthar na hEorpa, Meiriceá Thuaidh, An Astráil nó An Nua Shéalainn mar go bhfuil vacsaíní riachtanach nó molta nuair atá tú ag tabhairt cuairte ar thíortha áirithe

source: If malaria is a risk in the destination you plan to visit, then everyone including children should take appropriate precautions
ga: Má tá seans ann go bhfuil maláire san áit ina mbeidh tú ag taisteal, ba cheart do gach duine, na páistí san áireamh, réamhchúraimí oiriúnacha a thógáil

source: If your child has a history of illness at home, be prepared for a reoccurrence while abroad
ga: Má tá stair tinnis ag do pháiste ag baile bí réitithe don tinneas agus tú thar lear

source: Seek advice from your doctor in advance of travel and consider bringing an emergency supply of medication
ga: Faigh comhairle ó do dhochtúir sula dtéann tú ag taisteal agus tabhair soláthar leighis éigeándála leat

source: If you plan to travel within the EU, you should get a European Health Insurance Card for each person travelling before you leave Ireland as this will entitle you to emergency treatment in another EU country while abroad
ga: Má tá tú chun taisteal a dhéanamh laistigh de Chomhphobal na hEorpa, ba cheart duit a fháil Cárta Eorpach Árachas Sláinte do gach duine go bhfuil ag taisteal sula bhfágann tú Éire, beidh tú i dteideal cóir leighis éigeandála agus tú i dtír de chuid Chomhphobal na hEorpa

source: Children (especially infants) can be very sensitive to the sun and sunburn is a common cause of discomfort
ga: Tá páistí an-leochailleach (go háirithe naíonáin) don ghrian agus don dó gréine agus is cúis choitianta mí-chompord atá ann

source: Heatstroke can occur as a result of very hot temperatures, extreme physical exertion or sunburn
ga: Is féidir le stróc teas tarlú de thoradh teochtaí an-te nó dó gréine

source: Seek advice from your pharmacy or doctor before you travel about using high factor lotions, creams and sunblock and remember to take sensible precautions and keep children covered up
ga: Faigh comhairle ón Chógaslann nó an dochtúir maidir le fachtóir ard uachtair agus uachtar a chuireann bac ar an ghrian sula dtéann tú ag taisteal. Déan cinnte go mbíonn tú cúramach agus coinnigh páistí clúdaithe suas

source: Trying out new food is part of the experience while travelling abroad but taking sensible precautions can lessen the risk or illness or infection
ga: Nuair atá tú taisteal thar lear, tá tástáil bia mar pháirt den táithí ach má bhíonn tú cúramach tá níos lú seans ann go bhfaighidh tú galair nó galrú

source: It is also important that everyone in your party, particularly young children, drink plenty of bottled water if travelling to a hot country
ga: Tá sé tabhachtach go n-ólann gach duine sa ghrúpa, go háirithe páistí, a ndótháin uisce as buidéil má tá siad ag taisteal go dtí tíortha teo

source: Encourage your children to stay away from all animals while abroad and never attempt to bring an animal into Ireland on your return
ga: Cuir iachall ar pháistí fanacht glan ó ainmhithe agus tú thar lear agus ná tabhair ainmhí ar ais go hÉirinn ar do bhealach abhaile

source: The risk of rabies infection may be quite small but you should seek medical advice immediately in the event of any bites or scratches, especially those from dogs, cats or monkeys, while abroad
ga: Níl ach seans beag ann go bhfaighfeá galrú confadh ach ba cheart duit comhairle leighis a fháil láithreach má bhaintear greim asat nó scríobadh go háirithe ó mhadraí, ó chait agus moncaithe nuair atá tú thar lear

source: The HSE provides information on it's website on health risks when travelling and on how to prevent illness and infection when abroad
ga: Cuireann an FSS faisnéis ar a láithreán gréasáin ar rioscaí sláinte má tá tú ag taisteal agus ar an gcaoi a tinneas agus ionfhabhtú a chosc nuair atá tú thar lear

source: The Department of Foreign Affairs provides travel advice for those planning to travel abroad on its website
ga: Soláthraíonn an Roinn Gnóthaí Eachtracha comhairle taistil dóibh siúd atá ag pleanáil chun taisteal thar lear ar a láithreán gréasáin
